blocks/sgelection/info.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>2014-09-05 Questions</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="2014-09-05 Questions"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-05T13:48-0500"/>
<meta name="author" content="jpeak5"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">2014-09-05 Questions</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Commissioner Voting Status</a>
<ul>
<li><a href="#sec-1-1">1.1 When the polls open:</a></li>
<li><a href="#sec-1-2">1.2 Does the commissioner have to be enrolled full-time ?</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Part-time vs Fulltime</a>
<ul>
<li><a href="#sec-2-1">2.1 a student must have PT status to vote at all</a></li>
<li><a href="#sec-2-2">2.2 PT vs FT only matters on some resolutions</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Selecting the order of ballot elements</a></li>
<li><a href="#sec-4">4 We are planning to skip the CSV import, for now.</a></li>
<li><a href="#sec-5">5 Eligibility criteria:</a></li>
<li><a href="#sec-6">6 Real Time results</a></li>
<li><a href="#sec-7">7 Voting Analytics:</a>
<ul>
<li><a href="#sec-7-1">7.1 by student classification</a></li>
<li><a href="#sec-7-2">7.2 by full-time v part-time</a></li>
<li><a href="#sec-7-3">7.3 device type</a></li>
<li><a href="#sec-7-4">7.4 votes by time</a></li>
</ul>
</li>
<li><a href="#sec-8">8 email reports ?</a></li>
<li><a href="#sec-9">9 What should voters see ?</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Commissioner Voting Status</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> When the polls open:</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li><code>[&nbsp;]</code> does the commissioner get to vote ?
</li>
<li><code>[&nbsp;]</code> should we freeze all editing capability ?
</li>
<li><code>[&nbsp;]</code> should they be treated as an ordinary student ?
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Does the commissioner have to be enrolled full-time ?</h3>
<div class="outline-text-3" id="text-1-2">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Part-time vs Fulltime</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> a student must have PT status to vote at all</h3>
<div class="outline-text-3" id="text-2-1">


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> PT vs FT only matters on some resolutions</h3>
<div class="outline-text-3" id="text-2-2">


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Selecting the order of ballot elements</h2>
<div class="outline-text-2" id="text-3">

<p>  What is the priority ?
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> We are planning to skip the CSV import, for now.</h2>
<div class="outline-text-2" id="text-4">

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Eligibility criteria:</h2>
<div class="outline-text-2" id="text-5">

<p>  Besides pt/ft, is there any other eligibility criteria that you would need to take into consideration ?
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Real Time results</h2>
<div class="outline-text-2" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Voting Analytics:</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> by student classification</h3>
<div class="outline-text-3" id="text-7-1">

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> by full-time v part-time</h3>
<div class="outline-text-3" id="text-7-2">

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> device type</h3>
<div class="outline-text-3" id="text-7-3">

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> votes by time</h3>
<div class="outline-text-3" id="text-7-4">

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> email reports ?</h2>
<div class="outline-text-2" id="text-8">

<p>  will likely be just the same as what you can find in the UI
</p></div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> What should voters see ?</h2>
<div class="outline-text-2" id="text-9">

<p>  Display the vote count in the block.
</p>
<p>
  Once students have voted, links to vote will dissappear from the block, but this count should remain, perhaps with a "thanks for voting" message.
</p>
<p>
  The block should still not be visible at all for ineligible users. 
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-05T13:48-0500</p>
<p class="author">Author: jpeak5</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
